Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateMonolithicStairs Property
 Can't make monolithic Stairs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateMonolithicStairs { get; }
Public Shared ReadOnly Property CannotCreateMonolithicStairs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateMonolithicStairs {
	FailureDefinitionId^ get ();
}
static member CannotCreateMonolithicStairs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace